<template>
  <div class="QueryReport">
    <!-- 搜索框begin -->
    <div class="select">
      <el-form
        label-width="85px"
        :model="searchList"
        :rules="Rules"
        ref="searchList"
      >
        <el-row :gutter="30">
          <el-col
            :span="8"
            :style="getwidth(index)"
            v-for="(item, index) in searchtype"
            :key="index"
            v-if="isNullshow(index)"
          >
            <el-form-item
              :label="getname(index)"
              label-width="85px"
              class="TextColor"
              v-if="judgevalue(index)"
              :prop="`parameter${index}`"
            >
              <el-date-picker
                v-model="searchList[`parameter${index}`]"
                type="month"
                format="yyyy-MM"
                value-format="yyyy-MM"
                v-show="monthshow(index)"
              >
              </el-date-picker>
              <el-date-picker
                v-model="searchList[`parameter${index}`]"
                type="date"
                format="yyyy-MM-dd"
                value-format="yyyy-MM-dd"
                v-show="dateshow(index)"
              >
              </el-date-picker>
            </el-form-item>
            <el-form-item
              :label="getnames(index)"
              :label-width="getwidths(index)"
              v-if="showDiv(index)"
              :prop="`parameter${index}`"
            >
              <el-select
                v-model="searchList[`parameter${index}`]"
                multiple
                collapse-tags
                style="margin-left: 20px"
                placeholder="请选择"
                v-if="searchtype[index].type == 'dlmc'"
                filterable
                clearable
              >
                <el-option
                  v-for="(item, index) in options4"
                  :key="index"
                  :label="item.DLDA_DLMC"
                  :value="item.DLDA_DLMC"
                >
                </el-option>
              </el-select>
              <el-select
                v-model="searchList[`parameter${index}`]"
                multiple
                collapse-tags
                style="margin-left: 20px"
                placeholder="请选择"
                v-if="searchtype[index].type == 'fjdm'"
                filterable
                clearable
              >
                <el-option
                  v-for="(item, index) in options3"
                  :key="index"
                  :label="item.FJDA_FJID"
                  :value="item.FJDA_FJID"
                >
                </el-option>
              </el-select>
              <el-select
                v-model="searchList[`parameter${index}`]"
                multiple
                collapse-tags
                style="margin-left: 20px"
                placeholder="请选择"
                v-if="searchtype[index].type == 'khmc'"
                filterable
                clearable
              >
                <el-option
                  v-for="(item, index) in options2"
                  :key="index"
                  :label="item.KHDA_KHMC"
                  :value="item.KHDA_KHMC"
                >
                </el-option>
              </el-select>
              <el-select
                v-model="searchList[`parameter${index}`]"
                multiple
                collapse-tags
                style="margin-left: 20px"
                placeholder="请选择"
                v-if="searchtype[index].type == 'skfs'"
                filterable
                clearable
              >
                <el-option
                  v-for="(item, index) in options1"
                  :key="index"
                  :label="item.SFKM_SKFS"
                  :value="item.SFKM_ZJ"
                >
                </el-option>
              </el-select>
              <el-select
                v-model="searchList[`parameter${index}`]"
                multiple
                collapse-tags
                style="margin-left: 20px"
                placeholder="请选择"
                v-if="searchtype[index].type == 'sfxm'"
                filterable
                clearable
              >
                <el-option
                  v-for="(item, index) in options"
                  :key="index"
                  :label="item.CGBZ_XGFY"
                  :value="item.CGBZ_XGSFXMWJ"
                ></el-option>
              </el-select>
              <el-date-picker
                type="monthrange"
                v-model="searchList[`parameter${index}`]"
                is-range
                start-placeholder="访问开始时间"
                end-placeholder="访问截止日期"
                format="yyyy-MM"
                value-format="yyyy-MM"
                v-show="searchtype[index].type == 'nyqj'"
                clearable
              >
              </el-date-picker>
              <el-date-picker
                type="daterange"
                v-model="searchList[`parameter${index}`]"
                is-range
                start-placeholder="访问开始时间"
                end-placeholder="访问截止日期"
                format="yyyy-MM-dd"
                value-format="yyyy-MM-dd"
                v-show="searchtype[index].type == 'nyrqj'"
                clearable
              ></el-date-picker>
            </el-form-item>
          </el-col>

          <el-col :span="6">
            <el-form-item label-width="0px">
              <el-button type="success" @click="submit()" v-if="buttonshow"
                >查询</el-button
              >
              <el-button
                type="success"
                @click="downloadModel()"
                v-if="buttonshow"
                :disabled="printable"
                >导出报表
              </el-button>
            </el-form-item>
          </el-col>
        </el-row>
      </el-form>
    </div>
    <!-- 搜索框end -->
    <!-- 报表标题 -->
    <div class="ReportTitleDIV">
      <strong>{{ ReportTitleName }}</strong>
    </div>
    <!--  表begin -->
    <div class="resoureTable">
      <u-table
        ref="singleTable"
        max-height="520"
        :data="totaltableData"
        show-summary
        :summary-method="getSummaries"
        border
        use-virtual
        :row-height="35"
        lazy
      >
        <u-table-column
          :prop="item"
          :label="item"
          :min-width="columnwidth(item)"
          v-for="(item, index) in column"
          :key="index"
        >
          <template slot-scope="scope">
            {{
              formatMoney(
                scope.row[scope.column.property],
                scope.column.property
              )
            }}
          </template>
        </u-table-column>
      </u-table>
    </div>
    <!--  表 end -->
  </div>
</template>

<script>
import {
  queryHydroelectricityNumber,
  queryCurrentYear,
  sddsmxbExcel,
  queryPaymentMethods,
  queryClientList,
  queryRoomMessage,
  queryBuildingMessage,
} from "@/api/ReportManagement/QueryReport";
import {
  queryGeneralReportMessage,
  generalReportExcel,
} from "@/api/ReportManagement/CategorySet";
import { queryRelatedFees } from "@/api/FeeManagement/StandardDefinition.js";
import { formatMoney } from "@/utils/global.js";
import { UTable, UTableColumn } from "umy-ui";
export default {
  data() {
    return {
      tableData: [], //列表参数
      searchList: {
        parameter1: "zhbyNull", //zhbyNull：与后端定义传入参数为空时则传入此值
        parameter2: "zhbyNull",
        parameter3: "zhbyNull",
        parameter4: "zhbyNull",
        parameter5: "zhbyNull",
        parameter6: "zhbyNull",
        parameter7: "zhbyNull",
        parameter8: "zhbyNull",
        parameter9: "zhbyNull",
        parameter10: "zhbyNull",
      },
      defaultList: {},
      data: [],
      searchtype: [],
      choosetime: [],
      type: true,
      column: [],
      options: [],
      options1: [],
      options2: [],
      options3: [],
      options4: [],
      Rules: {},
      procName: "",
      buttonshow: false,
      formatList: [],
      columnList: [],
      printable: true,
      totaltableData: [],
      tableindex: {
        begin: 0,
        end: 800,
        length: 0,
      }, //待选记录滚动分页索引
      ReportTitleName: "", //报表标题
    };
  },
  components: {
    UTable,
    UTableColumn,
  },
  mounted() {
    var flist =
      "1900-01;1900-02;1900-03;1900-04;1900-05;1900-06;1900-07;1900-08;1900-09;1900-10;1900-11;1900-12;1901-01;1901-02;1901-03;1901-04;1901-05;1901-06;1901-07;1901-08;1901-09;1901-10;1901-11;1901-12;1902-01;1902-02;1902-03;1902-04;1902-05;1902-06;1902-07;1902-08;1902-09;1902-10;1902-11;1902-12;1903-01;1903-02;1903-03;1903-04;1903-05;1903-06;1903-07;1903-08;1903-09;1903-10;1903-11;1903-12;1904-01;1904-02;1904-03;1904-04;1904-05;1904-06;1904-07;1904-08;1904-09;1904-10;1904-11;1904-12;1905-01;1905-02;1905-03;1905-04;1905-05;1905-06;1905-07;1905-08;1905-09;1905-10;1905-11;1905-12;1906-01;1906-02;1906-03;1906-04;1906-05;1906-06;1906-07;1906-08;1906-09;1906-10;1906-11;1906-12;1907-01;1907-02;1907-03;1907-04;1907-05;1907-06;1907-07;1907-08;1907-09;1907-10;1907-11;1907-12;1908-01;1908-02;1908-03;1908-04;1908-05;1908-06;1908-07;1908-08;1908-09;1908-10;1908-11;1908-12;1909-01;1909-02;1909-03;1909-04;1909-05;1909-06;1909-07;1909-08;1909-09;1909-10;1909-11;1909-12;1910-01;1910-02;1910-03;1910-04;1910-05;1910-06;1910-07;1910-08;1910-09;1910-10;1910-11;1910-12;1911-01;1911-02;1911-03;1911-04;1911-05;1911-06;1911-07;1911-08;1911-09;1911-10;1911-11;1911-12;1912-01;1912-02;1912-03;1912-04;1912-05;1912-06;1912-07;1912-08;1912-09;1912-10;1912-11;1912-12;1913-01;1913-02;1913-03;1913-04;1913-05;1913-06;1913-07;1913-08;1913-09;1913-10;1913-11;1913-12;1914-01;1914-02;1914-03;1914-04;1914-05;1914-06;1914-07;1914-08;1914-09;1914-10;1914-11;1914-12;1915-01;1915-02;1915-03;1915-04;1915-05;1915-06;1915-07;1915-08;1915-09;1915-10;1915-11;1915-12;1916-01;1916-02;1916-03;1916-04;1916-05;1916-06;1916-07;1916-08;1916-09;1916-10;1916-11;1916-12;1917-01;1917-02;1917-03;1917-04;1917-05;1917-06;1917-07;1917-08;1917-09;1917-10;1917-11;1917-12;1918-01;1918-02;1918-03;1918-04;1918-05;1918-06;1918-07;1918-08;1918-09;1918-10;1918-11;1918-12;1919-01;1919-02;1919-03;1919-04;1919-05;1919-06;1919-07;1919-08;1919-09;1919-10;1919-11;1919-12;1920-01;1920-02;1920-03;1920-04;1920-05;1920-06;1920-07;1920-08;1920-09;1920-10;1920-11;1920-12;1921-01;1921-02;1921-03;1921-04;1921-05;1921-06;1921-07;1921-08;1921-09;1921-10;1921-11;1921-12;1922-01;1922-02;1922-03;1922-04;1922-05;1922-06;1922-07;1922-08;1922-09;1922-10;1922-11;1922-12;1923-01;1923-02;1923-03;1923-04;1923-05;1923-06;1923-07;1923-08;1923-09;1923-10;1923-11;1923-12;1924-01;1924-02;1924-03;1924-04;1924-05;1924-06;1924-07;1924-08;1924-09;1924-10;1924-11;1924-12;1925-01;1925-02;1925-03;1925-04;1925-05;1925-06;1925-07;1925-08;1925-09;1925-10;1925-11;1925-12;1926-01;1926-02;1926-03;1926-04;1926-05;1926-06;1926-07;1926-08;1926-09;1926-10;1926-11;1926-12;1927-01;1927-02;1927-03;1927-04;1927-05;1927-06;1927-07;1927-08;1927-09;1927-10;1927-11;1927-12;1928-01;1928-02;1928-03;1928-04;1928-05;1928-06;1928-07;1928-08;1928-09;1928-10;1928-11;1928-12;1929-01;1929-02;1929-03;1929-04;1929-05;1929-06;1929-07;1929-08;1929-09;1929-10;1929-11;1929-12;1930-01;1930-02;1930-03;1930-04;1930-05;1930-06;1930-07;1930-08;1930-09;1930-10;1930-11;1930-12;1931-01;1931-02;1931-03;1931-04;1931-05;1931-06;1931-07;1931-08;1931-09;1931-10;1931-11;1931-12;1932-01;1932-02;1932-03;1932-04;1932-05;1932-06;1932-07;1932-08;1932-09;1932-10;1932-11;1932-12;1933-01;1933-02;1933-03;1933-04;1933-05;1933-06;1933-07;1933-08;1933-09;1933-10;1933-11;1933-12;1934-01;1934-02;1934-03;1934-04;1934-05;1934-06;1934-07;1934-08;1934-09;1934-10;1934-11;1934-12;1935-01;1935-02;1935-03;1935-04;1935-05;1935-06;1935-07;1935-08;1935-09;1935-10;1935-11;1935-12;1936-01;1936-02;1936-03;1936-04;1936-05;1936-06;1936-07;1936-08;1936-09;1936-10;1936-11;1936-12;1937-01;1937-02;1937-03;1937-04;1937-05;1937-06;1937-07;1937-08;1937-09;1937-10;1937-11;1937-12;1938-01;1938-02;1938-03;1938-04;1938-05;1938-06;1938-07;1938-08;1938-09;1938-10;1938-11;1938-12;1939-01;1939-02;1939-03;1939-04;1939-05;1939-06;1939-07;1939-08;1939-09;1939-10;1939-11;1939-12;1940-01;1940-02;1940-03;1940-04;1940-05;1940-06;1940-07;1940-08;1940-09;1940-10;1940-11;1940-12;1941-01;1941-02;1941-03;1941-04;1941-05;1941-06;1941-07;1941-08;1941-09;1941-10;1941-11;1941-12;1942-01;1942-02;1942-03;1942-04;1942-05;1942-06;1942-07;1942-08;1942-09;1942-10;1942-11;1942-12;1943-01;1943-02;1943-03;1943-04;1943-05;1943-06;1943-07;1943-08;1943-09;1943-10;1943-11;1943-12;1944-01;1944-02;1944-03;1944-04;1944-05;1944-06;1944-07;1944-08;1944-09;1944-10;1944-11;1944-12;1945-01;1945-02;1945-03;1945-04;1945-05;1945-06;1945-07;1945-08;1945-09;1945-10;1945-11;1945-12;1946-01;1946-02;1946-03;1946-04;1946-05;1946-06;1946-07;1946-08;1946-09;1946-10;1946-11;1946-12;1947-01;1947-02;1947-03;1947-04;1947-05;1947-06;1947-07;1947-08;1947-09;1947-10;1947-11;1947-12;1948-01;1948-02;1948-03;1948-04;1948-05;1948-06;1948-07;1948-08;1948-09;1948-10;1948-11;1948-12;1949-01;1949-02;1949-03;1949-04;1949-05;1949-06;1949-07;1949-08;1949-09;1949-10;1949-11;1949-12;1950-01;1950-02;1950-03;1950-04;1950-05;1950-06;1950-07;1950-08;1950-09;1950-10;1950-11;1950-12;1951-01;1951-02;1951-03;1951-04;1951-05;1951-06;1951-07;1951-08;1951-09;1951-10;1951-11;1951-12;1952-01;1952-02;1952-03;1952-04;1952-05;1952-06;1952-07;1952-08;1952-09;1952-10;1952-11;1952-12;1953-01;1953-02;1953-03;1953-04;1953-05;1953-06;1953-07;1953-08;1953-09;1953-10;1953-11;1953-12;1954-01;1954-02;1954-03;1954-04;1954-05;1954-06;1954-07;1954-08;1954-09;1954-10;1954-11;1954-12;1955-01;1955-02;1955-03;1955-04;1955-05;1955-06;1955-07;1955-08;1955-09;1955-10;1955-11;1955-12;1956-01;1956-02;1956-03;1956-04;1956-05;1956-06;1956-07;1956-08;1956-09;1956-10;1956-11;1956-12;1957-01;1957-02;1957-03;1957-04;1957-05;1957-06;1957-07;1957-08;1957-09;1957-10;1957-11;1957-12;1958-01;1958-02;1958-03;1958-04;1958-05;1958-06;1958-07;1958-08;1958-09;1958-10;1958-11;1958-12;1959-01;1959-02;1959-03;1959-04;1959-05;1959-06;1959-07;1959-08;1959-09;1959-10;1959-11;1959-12;1960-01;1960-02;1960-03;1960-04;1960-05;1960-06;1960-07;1960-08;1960-09;1960-10;1960-11;1960-12;1961-01;1961-02;1961-03;1961-04;1961-05;1961-06;1961-07;1961-08;1961-09;1961-10;1961-11;1961-12;1962-01;1962-02;1962-03;1962-04;1962-05;1962-06;1962-07;1962-08;1962-09;1962-10;1962-11;1962-12;1963-01;1963-02;1963-03;1963-04;1963-05;1963-06;1963-07;1963-08;1963-09;1963-10;1963-11;1963-12;1964-01;1964-02;1964-03;1964-04;1964-05;1964-06;1964-07;1964-08;1964-09;1964-10;1964-11;1964-12;1965-01;1965-02;1965-03;1965-04;1965-05;1965-06;1965-07;1965-08;1965-09;1965-10;1965-11;1965-12;1966-01;1966-02;1966-03;1966-04;1966-05;1966-06;1966-07;1966-08;1966-09;1966-10;1966-11;1966-12;1967-01;1967-02;1967-03;1967-04;1967-05;1967-06;1967-07;1967-08;1967-09;1967-10;1967-11;1967-12;1968-01;1968-02;1968-03;1968-04;1968-05;1968-06;1968-07;1968-08;1968-09;1968-10;1968-11;1968-12;1969-01;1969-02;1969-03;1969-04;1969-05;1969-06;1969-07;1969-08;1969-09;1969-10;1969-11;1969-12;1970-01;1970-02;1970-03;1970-04;1970-05;1970-06;1970-07;1970-08;1970-09;1970-10;1970-11;1970-12;1971-01;1971-02;1971-03;1971-04;1971-05;1971-06;1971-07;1971-08;1971-09;1971-10;1971-11;1971-12;1972-01;1972-02;1972-03;1972-04;1972-05;1972-06;1972-07;1972-08;1972-09;1972-10;1972-11;1972-12;1973-01;1973-02;1973-03;1973-04;1973-05;1973-06;1973-07;1973-08;1973-09;1973-10;1973-11;1973-12;1974-01;1974-02;1974-03;1974-04;1974-05;1974-06;1974-07;1974-08;1974-09;1974-10;1974-11;1974-12;1975-01;1975-02;1975-03;1975-04;1975-05;1975-06;1975-07;1975-08;1975-09;1975-10;1975-11;1975-12;1976-01;1976-02;1976-03;1976-04;1976-05;1976-06;1976-07;1976-08;1976-09;1976-10;1976-11;1976-12;1977-01;1977-02;1977-03;1977-04;1977-05;1977-06;1977-07;1977-08;1977-09;1977-10;1977-11;1977-12;1978-01;1978-02;1978-03;1978-04;1978-05;1978-06;1978-07;1978-08;1978-09;1978-10;1978-11;1978-12;1979-01;1979-02;1979-03;1979-04;1979-05;1979-06;1979-07;1979-08;1979-09;1979-10;1979-11;1979-12;1980-01;1980-02;1980-03;1980-04;1980-05;1980-06;1980-07;1980-08;1980-09;1980-10;1980-11;1980-12;1981-01;1981-02;1981-03;1981-04;1981-05;1981-06;1981-07;1981-08;1981-09;1981-10;1981-11;1981-12;1982-01;1982-02;1982-03;1982-04;1982-05;1982-06;1982-07;1982-08;1982-09;1982-10;1982-11;1982-12;1983-01;1983-02;1983-03;1983-04;1983-05;1983-06;1983-07;1983-08;1983-09;1983-10;1983-11;1983-12;1984-01;1984-02;1984-03;1984-04;1984-05;1984-06;1984-07;1984-08;1984-09;1984-10;1984-11;1984-12;1985-01;1985-02;1985-03;1985-04;1985-05;1985-06;1985-07;1985-08;1985-09;1985-10;1985-11;1985-12;1986-01;1986-02;1986-03;1986-04;1986-05;1986-06;1986-07;1986-08;1986-09;1986-10;1986-11;1986-12;1987-01;1987-02;1987-03;1987-04;1987-05;1987-06;1987-07;1987-08;1987-09;1987-10;1987-11;1987-12;1988-01;1988-02;1988-03;1988-04;1988-05;1988-06;1988-07;1988-08;1988-09;1988-10;1988-11;1988-12;1989-01;1989-02;1989-03;1989-04;1989-05;1989-06;1989-07;1989-08;1989-09;1989-10;1989-11;1989-12;1990-01;1990-02;1990-03;1990-04;1990-05;1990-06;1990-07;1990-08;1990-09;1990-10;1990-11;1990-12;1991-01;1991-02;1991-03;1991-04;1991-05;1991-06;1991-07;1991-08;1991-09;1991-10;1991-11;1991-12;1992-01;1992-02;1992-03;1992-04;1992-05;1992-06;1992-07;1992-08;1992-09;1992-10;1992-11;1992-12;1993-01;1993-02;1993-03;1993-04;1993-05;1993-06;1993-07;1993-08;1993-09;1993-10;1993-11;1993-12;1994-01;1994-02;1994-03;1994-04;1994-05;1994-06;1994-07;1994-08;1994-09;1994-10;1994-11;1994-12;1995-01;1995-02;1995-03;1995-04;1995-05;1995-06;1995-07;1995-08;1995-09;1995-10;1995-11;1995-12;1996-01;1996-02;1996-03;1996-04;1996-05;1996-06;1996-07;1996-08;1996-09;1996-10;1996-11;1996-12;1997-01;1997-02;1997-03;1997-04;1997-05;1997-06;1997-07;1997-08;1997-09;1997-10;1997-11;1997-12;1998-01;1998-02;1998-03;1998-04;1998-05;1998-06;1998-07;1998-08;1998-09;1998-10;1998-11;1998-12;1999-01;1999-02;1999-03;1999-04;1999-05;1999-06;1999-07;1999-08;1999-09;1999-10;1999-11;1999-12;2000-01;2000-02;2000-03;2000-04;2000-05;2000-06;2000-07;2000-08;2000-09;2000-10;2000-11;2000-12;2001-01;2001-02;2001-03;2001-04;2001-05;2001-06;2001-07;2001-08;2001-09;2001-10;2001-11;2001-12;2002-01;2002-02;2002-03;2002-04;2002-05;2002-06;2002-07;2002-08;2002-09;2002-10;2002-11;2002-12;2003-01;2003-02;2003-03;2003-04;2003-05;2003-06;2003-07;2003-08;2003-09;2003-10;2003-11;2003-12;2004-01;2004-02;2004-03;2004-04;2004-05;2004-06;2004-07;2004-08;2004-09;2004-10;2004-11;2004-12;2005-01;2005-02;2005-03;2005-04;2005-05;2005-06;2005-07;2005-08;2005-09;2005-10;2005-11;2005-12;2006-01;2006-02;2006-03;2006-04;2006-05;2006-06;2006-07;2006-08;2006-09;2006-10;2006-11;2006-12;2007-01;2007-02;2007-03;2007-04;2007-05;2007-06;2007-07;2007-08;2007-09;2007-10;2007-11;2007-12;2008-01;2008-02;2008-03;2008-04;2008-05;2008-06;2008-07;2008-08;2008-09;2008-10;2008-11;2008-12;2009-01;2009-02;2009-03;2009-04;2009-05;2009-06;2009-07;2009-08;2009-09;2009-10;2009-11;2009-12;2010-01;2010-02;2010-03;2010-04;2010-05;2010-06;2010-07;2010-08;2010-09;2010-10;2010-11;2010-12;2011-01;2011-02;2011-03;2011-04;2011-05;2011-06;2011-07;2011-08;2011-09;2011-10;2011-11;2011-12;2012-01;2012-02;2012-03;2012-04;2012-05;2012-06;2012-07;2012-08;2012-09;2012-10;2012-11;2012-12;2013-01;2013-02;2013-03;2013-04;2013-05;2013-06;2013-07;2013-08;2013-09;2013-10;2013-11;2013-12;2014-01;2014-02;2014-03;2014-04;2014-05;2014-06;2014-07;2014-08;2014-09;2014-10;2014-11;2014-12;2015-01;2015-02;2015-03;2015-04;2015-05;2015-06;2015-07;2015-08;2015-09;2015-10;2015-11;2015-12;2016-01;2016-02;2016-03;2016-04;2016-05;2016-06;2016-07;2016-08;2016-09;2016-10;2016-11;2016-12;2017-01;2017-02;2017-03;2017-04;2017-05;2017-06;2017-07;2017-08;2017-09;2017-10;2017-11;2017-12;2018-01;2018-02;2018-03;2018-04;2018-05;2018-06;2018-07;2018-08;2018-09;2018-10;2018-11;2018-12;2019-01;2019-02;2019-03;2019-04;2019-05;2019-06;2019-07;2019-08;2019-09;2019-10;2019-11;2019-12;2020-01;2020-02;2020-03;2020-04;2020-05;2020-06;2020-07;2020-08;2020-09;2020-10;2020-11;2020-12;2021-01;2021-02;2021-03;2021-04;2021-05;2021-06;2021-07;2021-08;2021-09;2021-10;2021-11;2021-12;2022-01;2022-02;2022-03;2022-04;2022-05;2022-06;2022-07;2022-08;2022-09;2022-10;2022-11;2022-12;2023-01;2023-02;2023-03;2023-04;2023-05;2023-06;2023-07;2023-08;2023-09;2023-10;2023-11;2023-12;2024-01;2024-02;2024-03;2024-04;2024-05;2024-06;2024-07;2024-08;2024-09;2024-10;2024-11;2024-12;2025-01;2025-02;2025-03;2025-04;2025-05;2025-06;2025-07;2025-08;2025-09;2025-10;2025-11;2025-12;2026-01;2026-02;2026-03;2026-04;2026-05;2026-06;2026-07;2026-08;2026-09;2026-10;2026-11;2026-12;2027-01;2027-02;2027-03;2027-04;2027-05;2027-06;2027-07;2027-08;2027-09;2027-10;2027-11;2027-12;2028-01;2028-02;2028-03;2028-04;2028-05;2028-06;2028-07;2028-08;2028-09;2028-10;2028-11;2028-12;2029-01;2029-02;2029-03;2029-04;2029-05;2029-06;2029-07;2029-08;2029-09;2029-10;2029-11;2029-12;2030-01;2030-02;2030-03;2030-04;2030-05;2030-06;2030-07;2030-08;2030-09;2030-10;2030-11;2030-12;2031-01;2031-02;2031-03;2031-04;2031-05;2031-06;2031-07;2031-08;2031-09;2031-10;2031-11;2031-12;2032-01;2032-02;2032-03;2032-04;2032-05;2032-06;2032-07;2032-08;2032-09;2032-10;2032-11;2032-12;2033-01;2033-02;2033-03;2033-04;2033-05;2033-06;2033-07;2033-08;2033-09;2033-10;2033-11;2033-12;2034-01;2034-02;2034-03;2034-04;2034-05;2034-06;2034-07;2034-08;2034-09;2034-10;2034-11;2034-12;2035-01;2035-02;2035-03;2035-04;2035-05;2035-06;2035-07;2035-08;2035-09;2035-10;2035-11;2035-12;2036-01;2036-02;2036-03;2036-04;2036-05;2036-06;2036-07;2036-08;2036-09;2036-10;2036-11;2036-12;2037-01;2037-02;2037-03;2037-04;2037-05;2037-06;2037-07;2037-08;2037-09;2037-10;2037-11;2037-12;2038-01;2038-02;2038-03;2038-04;2038-05;2038-06;2038-07;2038-08;2038-09;2038-10;2038-11;2038-12;2039-01;2039-02;2039-03;2039-04;2039-05;2039-06;2039-07;2039-08;2039-09;2039-10;2039-11;2039-12;2040-01;2040-02;2040-03;2040-04;2040-05;2040-06;2040-07;2040-08;2040-09;2040-10;2040-11;2040-12;2041-01;2041-02;2041-03;2041-04;2041-05;2041-06;2041-07;2041-08;2041-09;2041-10;2041-11;2041-12;2042-01;2042-02;2042-03;2042-04;2042-05;2042-06;2042-07;2042-08;2042-09;2042-10;2042-11;2042-12;2043-01;2043-02;2043-03;2043-04;2043-05;2043-06;2043-07;2043-08;2043-09;2043-10;2043-11;2043-12;2044-01;2044-02;2044-03;2044-04;2044-05;2044-06;2044-07;2044-08;2044-09;2044-10;2044-11;2044-12;2045-01;2045-02;2045-03;2045-04;2045-05;2045-06;2045-07;2045-08;2045-09;2045-10;2045-11;2045-12;2046-01;2046-02;2046-03;2046-04;2046-05;2046-06;2046-07;2046-08;2046-09;2046-10;2046-11;2046-12;2047-01;2047-02;2047-03;2047-04;2047-05;2047-06;2047-07;2047-08;2047-09;2047-10;2047-11;2047-12;2048-01;2048-02;2048-03;2048-04;2048-05;2048-06;2048-07;2048-08;2048-09;2048-10;2048-11;2048-12;2049-01;2049-02;2049-03;2049-04;2049-05;2049-06;2049-07;2049-08;2049-09;2049-10;2049-11;2049-12;2050-01;2050-02;2050-03;2050-04;2050-05;2050-06;2050-07;2050-08;2050-09;2050-10;2050-11;2050-12;2051-01;2051-02;2051-03;2051-04;2051-05;2051-06;2051-07;2051-08;2051-09;2051-10;2051-11;2051-12;2052-01;2052-02;2052-03;2052-04;2052-05;2052-06;2052-07;2052-08;2052-09;2052-10;2052-11;2052-12;2053-01;2053-02;2053-03;2053-04;2053-05;2053-06;2053-07;2053-08;2053-09;2053-10;2053-11;2053-12;2054-01;2054-02;2054-03;2054-04;2054-05;2054-06;2054-07;2054-08;2054-09;2054-10;2054-11;2054-12;2055-01;2055-02;2055-03;2055-04;2055-05;2055-06;2055-07;2055-08;2055-09;2055-10;2055-11;2055-12;2056-01;2056-02;2056-03;2056-04;2056-05;2056-06;2056-07;2056-08;2056-09;2056-10;2056-11;2056-12;2057-01;2057-02;2057-03;2057-04;2057-05;2057-06;2057-07;2057-08;2057-09;2057-10;2057-11;2057-12;2058-01;2058-02;2058-03;2058-04;2058-05;2058-06;2058-07;2058-08;2058-09;2058-10;2058-11;2058-12;2059-01;2059-02;2059-03;2059-04;2059-05;2059-06;2059-07;2059-08;2059-09;2059-10;2059-11;2059-12;2060-01;2060-02;2060-03;2060-04;2060-05;2060-06;2060-07;2060-08;2060-09;2060-10;2060-11;2060-12;2061-01;2061-02;2061-03;2061-04;2061-05;2061-06;2061-07;2061-08;2061-09;2061-10;2061-11;2061-12;2062-01;2062-02;2062-03;2062-04;2062-05;2062-06;2062-07;2062-08;2062-09;2062-10;2062-11;2062-12;2063-01;2063-02;2063-03;2063-04;2063-05;2063-06;2063-07;2063-08;2063-09;2063-10;2063-11;2063-12;2064-01;2064-02;2064-03;2064-04;2064-05;2064-06;2064-07;2064-08;2064-09;2064-10;2064-11;2064-12;2065-01;2065-02;2065-03;2065-04;2065-05;2065-06;2065-07;2065-08;2065-09;2065-10;2065-11;2065-12;2066-01;2066-02;2066-03;2066-04;2066-05;2066-06;2066-07;2066-08;2066-09;2066-10;2066-11;2066-12;2067-01;2067-02;2067-03;2067-04;2067-05;2067-06;2067-07;2067-08;2067-09;2067-10;2067-11;2067-12;2068-01;2068-02;2068-03;2068-04;2068-05;2068-06;2068-07;2068-08;2068-09;2068-10;2068-11;2068-12;2069-01;2069-02;2069-03;2069-04;2069-05;2069-06;2069-07;2069-08;2069-09;2069-10;2069-11;2069-12;2070-01;2070-02;2070-03;2070-04;2070-05;2070-06;2070-07;2070-08;2070-09;2070-10;2070-11;2070-12;2071-01;2071-02;2071-03;2071-04;2071-05;2071-06;2071-07;2071-08;2071-09;2071-10;2071-11;2071-12;2072-01;2072-02;2072-03;2072-04;2072-05;2072-06;2072-07;2072-08;2072-09;2072-10;2072-11;2072-12;2073-01;2073-02;2073-03;2073-04;2073-05;2073-06;2073-07;2073-08;2073-09;2073-10;2073-11;2073-12;2074-01;2074-02;2074-03;2074-04;2074-05;2074-06;2074-07;2074-08;2074-09;2074-10;2074-11;2074-12;2075-01;2075-02;2075-03;2075-04;2075-05;2075-06;2075-07;2075-08;2075-09;2075-10;2075-11;2075-12;2076-01;2076-02;2076-03;2076-04;2076-05;2076-06;2076-07;2076-08;2076-09;2076-10;2076-11;2076-12;2077-01;2077-02;2077-03;2077-04;2077-05;2077-06;2077-07;2077-08;2077-09;2077-10;2077-11;2077-12;2078-01;2078-02;2078-03;2078-04;2078-05;2078-06;2078-07;2078-08;2078-09;2078-10;2078-11;2078-12;2079-01;2079-02;2079-03;2079-04;2079-05;2079-06;2079-07;2079-08;2079-09;2079-10;2079-11;2079-12;2080-01;2080-02;2080-03;2080-04;2080-05;2080-06;2080-07;2080-08;2080-09;2080-10;2080-11;2080-12;2081-01;2081-02;2081-03;2081-04;2081-05;2081-06;2081-07;2081-08;2081-09;2081-10;2081-11;2081-12;2082-01;2082-02;2082-03;2082-04;2082-05;2082-06;2082-07;2082-08;2082-09;2082-10;2082-11;2082-12;2083-01;2083-02;2083-03;2083-04;2083-05;2083-06;2083-07;2083-08;2083-09;2083-10;2083-11;2083-12;2084-01;2084-02;2084-03;2084-04;2084-05;2084-06;2084-07;2084-08;2084-09;2084-10;2084-11;2084-12;2085-01;2085-02;2085-03;2085-04;2085-05;2085-06;2085-07;2085-08;2085-09;2085-10;2085-11;2085-12;2086-01;2086-02;2086-03;2086-04;2086-05;2086-06;2086-07;2086-08;2086-09;2086-10;2086-11;2086-12;2087-01;2087-02;2087-03;2087-04;2087-05;2087-06;2087-07;2087-08;2087-09;2087-10;2087-11;2087-12;2088-01;2088-02;2088-03;2088-04;2088-05;2088-06;2088-07;2088-08;2088-09;2088-10;2088-11;2088-12;2089-01;2089-02;2089-03;2089-04;2089-05;2089-06;2089-07;2089-08;2089-09;2089-10;2089-11;2089-12;2090-01;2090-02;2090-03;2090-04;2090-05;2090-06;2090-07;2090-08;2090-09;2090-10;2090-11;2090-12;2091-01;2091-02;2091-03;2091-04;2091-05;2091-06;2091-07;2091-08;2091-09;2091-10;2091-11;2091-12;2092-01;2092-02;2092-03;2092-04;2092-05;2092-06;2092-07;2092-08;2092-09;2092-10;2092-11;2092-12;2093-01;2093-02;2093-03;2093-04;2093-05;2093-06;2093-07;2093-08;2093-09;2093-10;2093-11;2093-12;2094-01;2094-02;2094-03;2094-04;2094-05;2094-06;2094-07;2094-08;2094-09;2094-10;2094-11;2094-12;2095-01;2095-02;2095-03;2095-04;2095-05;2095-06;2095-07;2095-08;2095-09;2095-10;2095-11;2095-12;2096-01;2096-02;2096-03;2096-04;2096-05;2096-06;2096-07;2096-08;2096-09;2096-10;2096-11;2096-12;2097-01;2097-02;2097-03;2097-04;2097-05;2097-06;2097-07;2097-08;2097-09;2097-10;2097-11;2097-12;2098-01;2098-02;2098-03;2098-04;2098-05;2098-06;2098-07;2098-08;2098-09;2098-10;2098-11;2098-12;2099-01;2099-02;2099-03;2099-04;2099-05;2099-06;2099-07;2099-08;2099-09;2099-10;2099-11;2099-12;车位管理费;代收公摊水费;代收自来水水费及污水处理费;公共维修金;公摊电费;物业管理费;物业管理费合计;物业管理费_本月费用;物业管理费_往月费用;物业管理费_未来月费用;物业管理费_滞纳金;公共维修金合计;公共维修金_本月费用;公共维修金_往月费用;公共维修金_未来月费用;公共维修金_滞纳金;车位管理费合计;车位管理费_本月费用;车位管理费_往月费用;车位管理费_未来月费用;车位管理费_滞纳金;装修押金合计;装修押金_本月费用;装修押金_往月费用;装修押金_未来月费用;装修押金_滞纳金;土头清运费合计;土头清运费_本月费用;土头清运费_往月费用;土头清运费_未来月费用;土头清运费_滞纳金;代收公摊水费合计;代收公摊水费_本月费用;代收公摊水费_往月费用;代收公摊水费_未来月费用;代收公摊水费_滞纳金;公摊电费合计;公摊电费_本月费用;公摊电费_往月费用;公摊电费_未来月费用;公摊电费_滞纳金;代收自来水水费及污水处理费合计;代收自来水水费及污水处理费_本月费用;代收自来水水费及污水处理费_往月费用;代收自来水水费及污水处理费_未来月费用;代收自来水水费及污水处理费_滞纳金;出入证合计;出入证_本月费用;出入证_往月费用;出入证_未来月费用;出入证_滞纳金;门禁扣合计;门禁扣_本月费用;门禁扣_往月费用;门禁扣_未来月费用;门禁扣_滞纳金;POS机手续费合计;POS机手续费_本月费用;POS机手续费_往月费用;POS机手续费_未来月费用;POS机手续费_滞纳金;电费    合计;电费    _本月费用;电费    _往月费用;电费    _未来月费用;电费    _滞纳金;定额临时停车费合计;定额临时停车费_本月费用;定额临时停车费_往月费用;定额临时停车费_未来月费用;定额临时停车费_滞纳金;临时停车费合计;临时停车费_本月费用;临时停车费_往月费用;临时停车费_未来月费用;临时停车费_滞纳金;电梯使用押金合计;电梯使用押金_本月费用;电梯使用押金_往月费用;电梯使用押金_未来月费用;电梯使用押金_滞纳金;本月费用;往月费用;未来月费用;滞纳金合计;费用合计;车位管理费;公共维修金;物业管理费;往期应收;本期应收;往期实收;本期实收;往年预收本期;预交实收;物业管理费_本月应收;物业管理费_往月欠收;物业管理费_应收合计;公共维修金_本月应收;公共维修金_往月欠收;公共维修金_应收合计;车位管理费_本月应收;车位管理费_往月欠收;车位管理费_应收合计;装修押金_本月应收;装修押金_往月欠收;装修押金_应收合计;土头清运费_本月应收;土头清运费_往月欠收;土头清运费_应收合计;代收公摊水费_本月应收;代收公摊水费_往月欠收;代收公摊水费_应收合计;公摊电费_本月应收;公摊电费_往月欠收;公摊电费_应收合计;代收自来水水费及污水处理费_本月应收;代收自来水水费及污水处理费_往月欠收;代收自来水水费及污水处理费_应收合计;出入证_本月应收;出入证_往月欠收;出入证_应收合计;门禁扣_本月应收;门禁扣_往月欠收;门禁扣_应收合计;POS机手续费_本月应收;POS机手续费_往月欠收;POS机手续费_应收合计;电费    _本月应收;电费    _往月欠收;电费    _应收合计;定额临时停车费_本月应收;定额临时停车费_往月欠收;定额临时停车费_应收合计;临时停车费_本月应收;临时停车费_往月欠收;临时停车费_应收合计;电梯使用押金_本月应收;电梯使用押金_往月欠收;电梯使用押金_应收合计;本月应收;往月欠收;应收合计;车位管理费;公共维修金;物业管理费;合计;车位管理费;公共维修金;物业管理费;应收合计;车位管理费;代收公摊水费;代收自来水水费及污水处理费;公共维修金;公摊电费;物业管理费;车位管理费;公共维修金;物业管理费;合计;YCXSF_SFJE;YCXSF_TKJE;YCXSF_TKYE;SKPZ_SKJE;本月应收;往月应收;本月实收;往月实收;应收小计;实收小计;月末未收款;本月应收;往月应收;本月实收;往月实收;应收小计;实收小计;月末未收款;单价;总表金额;收费金额;合计;车位管理费;代收公摊水费;代收自来水水费及污水处理费;公共维修金;公摊电费;物业管理费;应收数;往年欠收数;已收数;收未来年月;收往年欠款;收本年欠款;收入小计;收入合计;应收数;往年欠收数;已收数;收未来年月;收往年欠款;收本年欠款;收入小计;收入合计;车位管理费;公共维修金;公摊电费;公摊水费;物业管理费;代收自来水水费及污水处理费;土头清运费;装修押金;车位公维金;定期停车费;车库管理费;车位管理费;代收公摊水费;代收自来水水费及污水处理费;公共维修金;公摊电费;物业管理费;车库电费;合计;车位管理费;代收公摊水费;代收自来水水费及污水处理费;公共维修金;公摊电费";
    this.formatList = flist.split(";"); //金额进行格式化数组
    var clist =
      "序号;项目名称;管理区名称;楼栋名称;房间代码;客户名称;银行账号;建筑面积;联系电话;手机;大楼名称;房间号;手机号码;日期;大楼名称;收款人;收款方式;票据号;ycxsf_fkgxwj;fjda_fjid;fjda_fjmc;glcid;yxdid;SFXM_ZJ;DLDA_ZJ;累计收缴率;TJNY;SFXMMC;glcid;yxdid;glcmc;"; //不进行合计数组
    this.columnList = clist.split(";");
  },
  methods: {
    getwidth(index) {
      //根据搜索条件类型判断搜索条件框的宽度
      return `width:${
        this.data[`parameterType${index}`] == "nyqj" ||
        this.data[`parameterType${index}`] == "nyrqj"
          ? 500
          : 350
      }px`;
    },
    isNullshow(index) {
      //根据条件是否为空判断搜索条件是否显示
      return (
        this.searchList[`parameter${index}`] != "zhbyNull" ||
        this.searchList[`parameter${index}`] == null
      );
    },
    getname(index) {
      //获取搜索条件名称
      return `${
        this.searchtype[index].type == "ny"
          ? "年月"
          : this.searchtype[index].type == "qsny"
          ? "起始年月"
          : this.searchtype[index].type == "jzny"
          ? "截止年月"
          : this.searchtype[index].type == "nyr"
          ? "年月日"
          : this.searchtype[index].type == "qsnyr"
          ? "起始年月日"
          : "截止年月日"
      }`;
    },
    judgevalue(index) {
      //跟据搜索条件展示不同数据条件的框
      return (
        (typeof this.searchList[`parameter${index}`] == "string" ||
          JSON.stringify(this.searchList[`parameter${index}`]) === "null") &&
        (this.searchtype[index].type == "ny" ||
          this.searchtype[index].type == "nyr" ||
          this.searchtype[index].type == "qsny" ||
          this.searchtype[index].type == "jzny" ||
          this.searchtype[index].type == "qsnyr" ||
          this.searchtype[index].type == "jznyr")
      );
    },
    monthshow(index) {
      //年月搜索条件框
      return (
        this.searchtype[index].type == "ny" ||
        this.searchtype[index].type == "qsny" ||
        this.searchtype[index].type == "jzny"
      );
    },
    dateshow(index) {
      //年月日搜索条件框
      return (
        this.searchtype[index].type == "nyr" ||
        this.searchtype[index].type == "qsnyr" ||
        this.searchtype[index].type == "jznyr"
      );
    },
    getnames(index) {
      //获取搜索条件名称
      return `${
        this.searchtype[index].type == "dlmc"
          ? "大楼名称"
          : this.searchtype[index].type == "fjdm"
          ? "房间代码"
          : this.searchtype[index].type == "khmc"
          ? "客户名称"
          : this.searchtype[index].type == "skfs"
          ? "收款方式"
          : this.searchtype[index].type == "sfxm"
          ? "收费项目"
          : this.searchtype[index].type == "nyqj"
          ? "年月区间"
          : "年月日区间"
      }`;
    },
    getwidths(index) {
      //根据搜索条件类型判断搜索条件框的宽度
      return this.searchtype[index].type == "nyrqj" ? "100px" : "85px";
    },
    showDiv(index) {
      //根据条件是否对象和搜索条件类型判断搜索条件是否显示
      return (
        typeof this.searchList[`parameter${index}`] == "object" &&
        (this.searchtype[index].type == "dlmc" ||
          this.searchtype[index].type == "khmc" ||
          this.searchtype[index].type == "fjdm" ||
          this.searchtype[index].type == "sfxm" ||
          this.searchtype[index].type == "skfs" ||
          this.searchtype[index].type == "nyqj" ||
          this.searchtype[index].type == "nyrqj")
      );
    },
    formatMoney(data, name) {
      //价格格式化
      if (this.formatList.indexOf(name) > -1) {
        return data >= 0
          ? formatMoney(data, true)
          : `-${formatMoney(0 - data, true)}`;
      } else {
        return data;
      }
    },
    getTableData(data) {
      //参数初始化
      this.ReportTitleName = data.name || ""; //报表标题
      this.defaultList = {
        value1: data.parameterDefault1,
        value2: data.parameterDefault2,
        value3: data.parameterDefault3,
        value4: data.parameterDefault4,
        value5: data.parameterDefault5,
        value6: data.parameterDefault6,
        value7: data.parameterDefault7,
        value8: data.parameterDefault8,
        value9: data.parameterDefault9,
        value10: data.parameterDefault10,
      };
      this.printable = true;
      this.buttonshow = false;
      this.column = [];
      this.tableData = [];
      this.searchList = {
        parameter1: "zhbyNull",
        parameter2: "zhbyNull",
        parameter3: "zhbyNull",
        parameter4: "zhbyNull",
        parameter5: "zhbyNull",
        parameter6: "zhbyNull",
        parameter7: "zhbyNull",
        parameter8: "zhbyNull",
        parameter9: "zhbyNull",
        parameter10: "zhbyNull",
        parameter11: "zhbyNull",
      };
      this.searchtype = [];
      this.data = data;
      this.searchtype.push("");
      if (data.parameterType1 != "") {
        this.searchtype.push({
          type: data.parameterType1,
          must: data.parameterMust1,
        });
        this.Rules.parameter1 = [
          {
            required: data.parameterMust1,
            message: "该值不能为空",
            trigger: "blur",
          },
        ];
        this.searchList.parameter1 =
          data.parameterType1 == "nyqj" ||
          data.parameterType1 == "nyrqj" ||
          data.parameterType1 == "sfxm" ||
          data.parameterType1 == "skfs" ||
          data.parameterType1 == "khmc" ||
          data.parameterType1 == "fjdm" ||
          data.parameterType1 == "dlmc"
            ? []
            : "";
      } else {
        this.searchtype.push({
          type: "",
          must: "",
        });
      }

      if (data.parameterType2 != "") {
        this.searchtype.push({
          type: data.parameterType2,
          must: data.parameterMust2,
        });
        this.Rules.parameter2 = [
          {
            required: data.parameterMust2,
            message: "该值不能为空",
            trigger: "blur",
          },
        ];
        this.searchList.parameter2 =
          data.parameterType2 == "nyqj" ||
          data.parameterType2 == "nyrqj" ||
          data.parameterType2 == "sfxm" ||
          data.parameterType2 == "skfs" ||
          data.parameterType2 == "khmc" ||
          data.parameterType2 == "fjdm" ||
          data.parameterType2 == "dlmc"
            ? []
            : "";
      } else {
        this.searchtype.push({
          type: "",
          must: "",
        });
      }

      if (data.parameterType3 != "") {
        this.searchtype.push({
          type: data.parameterType3,
          must: data.parameterMust3,
        });
        this.Rules.parameter3 = [
          {
            required: data.parameterMust3,
            message: "该值不能为空",
            trigger: "blur",
          },
        ];
        this.searchList.parameter3 =
          data.parameterType3 == "nyqj" ||
          data.parameterType3 == "nyrqj" ||
          data.parameterType3 == "sfxm" ||
          data.parameterType3 == "skfs" ||
          data.parameterType3 == "khmc" ||
          data.parameterType3 == "fjdm" ||
          data.parameterType3 == "dlmc"
            ? []
            : "";
      } else {
        this.searchtype.push({
          type: "",
          must: "",
        });
      }

      if (data.parameterType4 != "") {
        this.searchtype.push({
          type: data.parameterType4,
          must: data.parameterMust4,
        });
        this.Rules.parameter4 = [
          {
            required: data.parameterMust4,
            message: "该值不能为空",
            trigger: "blur",
          },
        ];
        this.searchList.parameter4 =
          data.parameterType4 == "nyqj" ||
          data.parameterType4 == "nyrqj" ||
          data.parameterType4 == "sfxm" ||
          data.parameterType4 == "skfs" ||
          data.parameterType4 == "khmc" ||
          data.parameterType4 == "fjdm" ||
          data.parameterType4 == "dlmc"
            ? []
            : "";
      } else {
        this.searchtype.push({
          type: "",
          must: "",
        });
      }

      if (data.parameterType5 != "") {
        this.searchtype.push({
          type: data.parameterType5,
          must: data.parameterMust5,
        });
        this.Rules.parameter5 = [
          {
            required: data.parameterMust5,
            message: "该值不能为空",
            trigger: "blur",
          },
        ];
        this.searchList.parameter5 =
          data.parameterType5 == "nyqj" ||
          data.parameterType5 == "nyrqj" ||
          data.parameterType5 == "sfxm" ||
          data.parameterType5 == "skfs" ||
          data.parameterType5 == "khmc" ||
          data.parameterType5 == "fjdm" ||
          data.parameterType5 == "dlmc"
            ? []
            : "";
      } else {
        this.searchtype.push({
          type: "",
          must: "",
        });
      }

      if (data.parameterType6 != "") {
        this.searchtype.push({
          type: data.parameterType6,
          must: data.parameterMust6,
        });
        this.Rules.parameter6 = [
          {
            required: data.parameterMust6,
            message: "该值不能为空",
            trigger: "blur",
          },
        ];
        this.searchList.parameter6 =
          data.parameterType6 == "nyqj" ||
          data.parameterType6 == "nyrqj" ||
          data.parameterType6 == "sfxm" ||
          data.parameterType6 == "skfs" ||
          data.parameterType6 == "khmc" ||
          data.parameterType6 == "fjdm" ||
          data.parameterType6 == "dlmc"
            ? []
            : "";
      } else {
        this.searchtype.push({
          type: "",
          must: "",
        });
      }

      if (data.parameterType7 != "") {
        this.searchtype.push({
          type: data.parameterType7,
          must: data.parameterMust7,
        });
        this.Rules.parameter7 = [
          {
            required: data.parameterMust7,
            message: "该值不能为空",
            trigger: "blur",
          },
        ];
        this.searchList.parameter7 =
          data.parameterType7 == "nyqj" ||
          data.parameterType7 == "nyrqj" ||
          data.parameterType7 == "sfxm" ||
          data.parameterType7 == "skfs" ||
          data.parameterType7 == "khmc" ||
          data.parameterType7 == "fjdm" ||
          data.parameterType7 == "dlmc"
            ? []
            : "";
      } else {
        this.searchtype.push({
          type: "",
          must: "",
        });
      }

      if (data.parameterType8 != "") {
        this.searchtype.push({
          type: data.parameterType8,
          must: data.parameterMust8,
        });
        this.Rules.parameter8 = [
          {
            required: data.parameterMust8,
            message: "该值不能为空",
            trigger: "blur",
          },
        ];
        this.searchList.parameter8 =
          data.parameterType8 == "nyqj" ||
          data.parameterType8 == "nyrqj" ||
          data.parameterType8 == "sfxm" ||
          data.parameterType8 == "skfs" ||
          data.parameterType8 == "khmc" ||
          data.parameterType8 == "fjdm" ||
          data.parameterType8 == "dlmc"
            ? []
            : "";
      } else {
        this.searchtype.push({
          type: "",
          must: "",
        });
      }

      if (data.parameterType9 != "") {
        this.searchtype.push({
          type: data.parameterType9,
          must: data.parameterMust9,
        });
        this.Rules.parameter9 = [
          {
            required: data.parameterMust9,
            message: "该值不能为空",
            trigger: "blur",
          },
        ];
        this.searchList.parameter9 =
          data.parameterType9 == "nyqj" ||
          data.parameterType9 == "nyrqj" ||
          data.parameterType9 == "sfxm" ||
          data.parameterType9 == "skfs" ||
          data.parameterType9 == "khmc" ||
          data.parameterType9 == "fjdm" ||
          data.parameterType9 == "dlmc"
            ? []
            : "";
      } else {
        this.searchtype.push({
          type: "",
          must: "",
        });
      }
      if (data.parameterType10 != "") {
        this.searchtype.push({
          type: data.parameterType10,
          must: data.parameterMust10,
        });
        this.Rules.parameter10 = [
          {
            required: data.parameterMust10,
            message: "该值不能为空",
            trigger: "blur",
          },
        ];
        this.searchList.parameter10 =
          data.parameterType10 == "nyqj" ||
          data.parameterType10 == "nyrqj" ||
          data.parameterType10 == "sfxm" ||
          data.parameterType10 == "skfs" ||
          data.parameterType10 == "khmc" ||
          data.parameterType10 == "fjdm" ||
          data.parameterType10 == "dlmc"
            ? []
            : "";
      } else {
        this.searchtype.push({
          type: "",
          must: "",
        });
      }
      delete this.searchtype[0];
      this.buttonshow = true;
      this.getRelatedFees();
    },
    getRelatedFees() {
      //搜索条件函数调用
      queryRelatedFees().then((response) => {
        var item = [];
        for (var i in response) {
          item.push(response[i].CGBZ_XGSFXMWJ);
        }
        this.options = response;
      });
      queryPaymentMethods().then((response) => {
        this.options1 = response;
      });
      queryClientList().then((response) => {
        this.options2 = response;
      });
      queryRoomMessage().then((response) => {
        this.options3 = response;
      });
      queryBuildingMessage().then((response) => {
        this.options4 = response;
      });
    },
    columnwidth(value) {
      var width = value.length * 18;
      return width < 150 ? 150 : width;
    },
    submit() {
      //提交查询
      this.$refs["searchList"].validate((valid) => {
        if (valid) {
          var submitList = {};
          submitList["procName"] = this.data.procName;
          for (var i = 1; i <= 10; i++) {
            if (this.searchList[`parameter${i}`] != "zhbyNull") {
              if (
                (typeof this.searchList[`parameter${i}`] == "string" ||
                  JSON.stringify(this.searchList[`parameter${i}`]) ===
                    "null") &&
                (this.searchtype[i].type == "ny" ||
                  this.searchtype[i].type == "nyr" ||
                  this.searchtype[i].type == "qsny" ||
                  this.searchtype[i].type == "jzny" ||
                  this.searchtype[i].type == "qsnyr" ||
                  this.searchtype[i].type == "jznyr")
              ) {
                submitList[`parameter${i}`] =
                  this.searchList[`parameter${i}`] === "" ||
                  this.searchList[`parameter${i}`] === null
                    ? "zhbyNull"
                    : this.searchList[`parameter${i}`];
                submitList[`must${i}`] = this.searchtype[i].must;
                if (
                  this.defaultList[`value${i}`] &&
                  submitList[`parameter${i}`] == "zhbyNull"
                ) {
                  switch (
                    this.searchtype[i].type //如果是时间搜索条件且用户未选择则默认数值
                  ) {
                    case "ny":
                      submitList[`parameter${i}`] = "1900-1";
                      break;
                    case "qsny":
                      submitList[`parameter${i}`] = "1900-1";
                      break;
                    case "jzny":
                      submitList[`parameter${i}`] = "1900-1";
                      break;
                    case "nyr":
                      submitList[`parameter${i}`] = "1900-1-1";
                      break;
                    case "qsnyr":
                      submitList[`parameter${i}`] = "1900-1-1";
                      break;
                    case "jznyr":
                      submitList[`parameter${i}`] = "1900-1-1";
                      break;
                  }
                }
              }
              if (
                typeof this.searchList[`parameter${i}`] == "object" &&
                (this.searchtype[i].type == "dlmc" ||
                  this.searchtype[i].type == "khmc" ||
                  this.searchtype[i].type == "fjdm" ||
                  this.searchtype[i].type == "skfs" ||
                  this.searchtype[i].type == "sfxm" ||
                  this.searchtype[i].type == "nyqj" ||
                  this.searchtype[i].type == "nyrqj")
              ) {
                var object =
                  this.searchtype[i].type === "dlmc" ||
                  this.searchtype[i].type === "khmc" ||
                  this.searchtype[i].type === "fjdm" ||
                  this.searchtype[i].type === "sfxm" ||
                  this.searchtype[i].type === "skfs"
                    ? this.searchList[`parameter${i}`].join(",")
                    : JSON.stringify(this.searchList[`parameter${i}`]);
                submitList[`parameter${i}`] =
                  object === "" || object === "[]" || object === "null"
                    ? "zhbyNull"
                    : object;
                submitList[`must${i}`] = this.searchtype[i].must;
              }
            }
          }
          queryGeneralReportMessage(submitList).then((response) => {
            this.column = response.data.column;
            this.printable = false;

            this.totaltableData = response.data.list;
            this.tableindex.length = response.data.list.length;
          });
        } else {
          return false;
        }
      });
    },
    downloadModel() {
      //下载模板
      this.$refs["searchList"].validate((valid) => {
        if (valid) {
          var submitList = {};
          submitList["procName"] = this.data.procName;
          for (var i = 1; i <= 10; i++) {
            if (this.searchList[`parameter${i}`] != "zhbyNull") {
              if (
                (typeof this.searchList[`parameter${i}`] == "string" ||
                  JSON.stringify(this.searchList[`parameter${i}`]) ===
                    "null") &&
                (this.searchtype[i].type == "ny" ||
                  this.searchtype[i].type == "nyr" ||
                  this.searchtype[i].type == "qsny" ||
                  this.searchtype[i].type == "jzny" ||
                  this.searchtype[i].type == "qsnyr" ||
                  this.searchtype[i].type == "jznyr")
              ) {
                submitList[`parameter${i}`] =
                  this.searchList[`parameter${i}`] === "" ||
                  this.searchList[`parameter${i}`] === null
                    ? "zhbyNull"
                    : this.searchList[`parameter${i}`];
                submitList[`must${i}`] = this.searchtype[i].must;
              }
              if (
                typeof this.searchList[`parameter${i}`] == "object" &&
                (this.searchtype[i].type == "dlmc" ||
                  this.searchtype[i].type == "khmc" ||
                  this.searchtype[i].type == "fjdm" ||
                  this.searchtype[i].type == "skfs" ||
                  this.searchtype[i].type == "sfxm" ||
                  this.searchtype[i].type == "nyqj" ||
                  this.searchtype[i].type == "nyrqj")
              ) {
                var object =
                  this.searchtype[i].type === "dlmc" ||
                  this.searchtype[i].type === "khmc" ||
                  this.searchtype[i].type === "fjdm" ||
                  this.searchtype[i].type === "skfs" ||
                  this.searchtype[i].type === "sfxm"
                    ? this.searchList[`parameter${i}`].join(",")
                    : JSON.stringify(this.searchList[`parameter${i}`]);
                submitList[`parameter${i}`] =
                  object === "" || object === "[]" || object === "null"
                    ? "zhbyNull"
                    : object;
                submitList[`must${i}`] = this.searchtype[i].must;
              }
            }
          }
          submitList.list = JSON.stringify(this.totaltableData);
          submitList.column = JSON.stringify(this.column);
          generalReportExcel(submitList).then((response) => {
            const content = response;
            const blob = new Blob([content]);
            const fileName = `${this.data.name}.xls`;
            if ("download" in document.createElement("a")) {
              // 非IE下载
              const elink = document.createElement("a");
              elink.download = fileName;
              elink.style.display = "none";
              elink.href = URL.createObjectURL(blob);
              document.body.appendChild(elink);
              elink.click();
              URL.revokeObjectURL(elink.href); // 释放URL 对象
              document.body.removeChild(elink);
            } else {
              // IE10+下载
              navigator.msSaveBlob(blob, fileName);
            }
          });
        } else {
          return false;
        }
      });
    },
    getSummaries(param) {
      const { columns, data } = param;
      const sums = [];
      columns.forEach((column, index) => {
        if (index === 0) {
          sums[index] = "总计";
          return;
        }
        if (this.columnList.indexOf(column.property) > 0) {
          sums[index] = "";
          return;
        }
        const values = this.totaltableData.map((item) =>
          Number(item[column.property])
        );
        var dataNaN = JSON.stringify(values);
        if (dataNaN.indexOf("null") > -1) {
          sums[index] = "";
          return;
        }
        if (!values.every((value) => isNaN(value))) {
          sums[index] = values.reduce((prev, curr) => {
            const value = Number(curr);
            if (!isNaN(value)) {
              return prev + curr;
            } else {
              return prev;
            }
          }, 0);
          sums[index] = this.formatMoney(
            parseFloat(sums[index].toFixed(2)),
            column.property
          );
        } else {
          sums[index] = "";
        }
      });
      return [sums];
    },
  },
};
</script>

<style lang="scss" scoped>
.resoureTable {
  margin-top: 20px;
  width: 100%;
  height: 100%;
  overflow: auto;
}

.block {
  text-align: right;
  padding: 15px 0 5px 0;
}

.resoureTable .el-date-editor--monthrange.el-input,
.el-date-editor--monthrange.el-input__inner {
  width: 350px;
}
</style>
<style>
.QueryReport .el-form-item {
  margin-bottom: 22px !important;
}

.QueryReport .el-date-editor .el-range-input {
  text-align: left;
}

.reposrt-isLoading .el-loading-text {
  font-size: 24px;
}

.QueryReport .el-input {
  width: 100% !important;
}
</style>
